### Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
import pandas as pd
ser = pd.Series([4,8,15,16,23,42])
ser

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

### Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [5]:
import pandas
list = [i for i in range(10)]
pandas.Series(list)

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

### Q3. Create a Pandas DataFrame that contains the following data:

| Name | Age | Gender |
|------|-----|--------|
| Alice| 25  | Female |
| Bob  | 30  | Male   | 
|Claire| 27  | Female |

In [7]:
import pandas as pd

dict = {"Name": ['Alice','Bob','Claire'],"Age":[25,30,27],"Gender":["Female","Male","Female"]}
df = pd.DataFrame(dict)
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

### Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

DataFrame and Series are two Datatypes in pandas library of python.

- Dataframe is Heterogeneos in nature which can store data in rows and columns whereas Series is Homogeneos in Nature which can store data in a single column.

In [9]:
import pandas as pd
import numpy as np

arr = np.arange(5)
pd.Series(arr)

0    0
1    1
2    2
3    3
4    4
dtype: int32

In [10]:
l1 = ['a','b','c']
l2 = [5,10,15]
dict ={"name":l1,"marks":l2}
pd.DataFrame(dict)

  name  marks
0    a      5
1    b     10
2    c     15

### Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

Answer - 

- head() and tail(): These functions display the first 5 rows (head()) or last 5 rows (tail()) of the DataFrame. They are helpful for a quick glance at the data.

- shape: Returns a tuple representing the dimensions of the DataFrame (number of rows and columns).

- isnull() and notnull(): These functions identify missing values (NaN) in the DataFrame and return a Boolean mask indicating whether each element is null or not.

- apply(): Applies a function along a specific axis (rows or columns) of the DataFrame.

In [21]:
df.head(2)

  names  age
0     a   10
1     b   12

In [22]:
df.isnull()

   names    age
0  False  False
1  False  False
2  False  False

### Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Answer - In pandas, all datatypes(Series, DataFrame and Panel) are value mutable but except Series all are size mutable

### Q7. Create a DataFrame using multiple Series. Explain with an example.

In [19]:
import pandas as pd

name = pd.Series(["a","b","c"])
age = pd.Series([10,12,45])
dict = {"names":name, "age":age}
df = pd.DataFrame(dict)

In [20]:
df

  names  age
0     a   10
1     b   12
2     c   45